app/helpers/sessions_helper.rb

    def current_user
        if session[:user_id]
            @current_user ||= Account.find_by(id: session[:user_id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]