app/controllers/accounts_controller.rb

    def create
        #render plain: params[:account].inspect
        @account = Account.new(account_params)

        email = account_params[:email]

        profileparams = Hash.new
        profileparams[:email] = email
        username = email.split('@')
        profileparams[:display_name] = username[0]
        profileparams[:language] = "english"
        profileparams[:avatar_url] = "placeholder"
        @profile = Profile.new(profileparams)

        if (@account.save and @profile.save)
---
INSERT INTO "accounts" ("email", "role", "password", "salt", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def show
        @account = Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]