app/controllers/sessions_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."email" = ? LIMIT ?  [["email", "dummy@gmail.com"], ["LIMIT", 1]]
---
  def create
      user = Account.find_by_email(params[:session][:email])