app/models/account.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."email" = ? LIMIT ?  [["email", "123@123.com"], ["LIMIT", 1]]
---
    def authenticate(email = "", login_password = "")
        account = Account.find_by_email(email)